[Survived] BlockStatement
src/Home.js:23:50
   // Create a notification at the top of the screen with given message for 10 seconds 
   // Notifications are of two types, "error" and "success"
   // The appearance of these two notifications can be adjusted via the index.css file
-  const notificationHandler = (message, type) => {
-    setNotification(message)
-    setNotificationType(type)
-
-    setTimeout(() => {
-      setNotificationType(null)
-      setNotification(null)
-    }, 3000)
-  }
+  const notificationHandler = (message, type) => {}
 
   // Function that handles login of users

[Survived] BlockStatement
src/Home.js:27:22
     setNotification(message)
     setNotificationType(type)
 
-    setTimeout(() => {
-      setNotificationType(null)
-      setNotification(null)
-    }, 3000)
+    setTimeout(() => {}, 3000)
   }
 

[Survived] BlockStatement
src/Home.js:34:46
   }
 
   // Function that handles login of users
-  const handleLogin = async (credentials) => {
-    try {
-      const userObject = await loginService.login(credentials)
-      setUser(userObject)
-      window.localStorage.setItem('loggedInUser', JSON.stringify(userObject))
-      
-      notificationHandler(`Logged in successfully as ${userObject.first_name}`, 'success')
-    }
-    catch (exception) {
-      notificationHandler(`Log in failed, check username and password entered`, 'error')
-    }
-  }
+  const handleLogin = async (credentials) => {}
 
 

[Survived] BlockStatement
src/Home.js:35:9
 
   // Function that handles login of users
   const handleLogin = async (credentials) => {
-    try {
-      const userObject = await loginService.login(credentials)
-      setUser(userObject)
-      window.localStorage.setItem('loggedInUser', JSON.stringify(userObject))
-      
-      notificationHandler(`Logged in successfully as ${userObject.first_name}`, 'success')
-    }
+    try {}
     catch (exception) {
       notificationHandler(`Log in failed, check username and password entered`, 'error')

[Survived] StringLiteral
src/Home.js:40:27
       setUser(userObject)
       window.localStorage.setItem('loggedInUser', JSON.stringify(userObject))
       
-      notificationHandler(`Logged in successfully as ${userObject.first_name}`, 'success')
+      notificationHandler(``, 'success')
     }
     catch (exception) {

[Survived] BlockStatement
src/Home.js:42:23
       
       notificationHandler(`Logged in successfully as ${userObject.first_name}`, 'success')
     }
-    catch (exception) {
-      notificationHandler(`Log in failed, check username and password entered`, 'error')
-    }
+    catch (exception) {}
   }
 

[Survived] BlockStatement
src/Home.js:50:19
 
   // Effect Hook that parses the local storage for 'loggedInUser' and sets the "user" state if a valid match is found
   // This enables user to login automatically without having to type in the credentials. Caching the login if you will.
-  useEffect(() => {
-    const loggedInUser = window.localStorage.getItem('loggedInUser')
-    if (loggedInUser)
-      setUser(JSON.parse(loggedInUser))
-  }, [])
+  useEffect(() => {}, [])
 
   return (

[Survived] ConditionalExpression
src/Home.js:52:9
   // This enables user to login automatically without having to type in the credentials. Caching the login if you will.
   useEffect(() => {
     const loggedInUser = window.localStorage.getItem('loggedInUser')
-    if (loggedInUser)
+    if (false)
       setUser(JSON.parse(loggedInUser))
   }, [])

[Survived] ConditionalExpression
src/Home.js:52:9
   // This enables user to login automatically without having to type in the credentials. Caching the login if you will.
   useEffect(() => {
     const loggedInUser = window.localStorage.getItem('loggedInUser')
-    if (loggedInUser)
+    if (true)
       setUser(JSON.parse(loggedInUser))
   }, [])

[Survived] ConditionalExpression
src/Home.js:70:9
 
       {
         /* Show Login form when no login has happened */
-        user === null && 
-        <LoginForm startLogin={handleLogin}/>
+        true
       }
 

[Survived] ConditionalExpression
src/Home.js:70:9
 
       {
         /* Show Login form when no login has happened */
-        user === null && 
+        true && 
         <LoginForm startLogin={handleLogin}/>
       }

[Survived] ConditionalExpression
src/Home.js:76:9
 
       {
         /* Show NavBar when login has happened */
-        user && 
-        <NavBar user={user} setUser={setUser}/>
+        true
       } 
 

[Survived] ConditionalExpression
src/Home.js:76:9
 
       {
         /* Show NavBar when login has happened */
-        user && 
-        <NavBar user={user} setUser={setUser}/>
+        false
       } 
 

[Survived] LogicalOperator
src/Home.js:82:9
 
     {
         /* Show NavBar when login has happened */
-        user && 
-        <Salary user={user} setUser={setUser}/>
+        /* Show NavBar when login has happened */
+user || <Salary user={user} setUser={setUser} />
     }
 

[Survived] ConditionalExpression
src/Home.js:82:9
 
     {
         /* Show NavBar when login has happened */
-        user && 
-        <Salary user={user} setUser={setUser}/>
+        true
     }
 
