[Survived] StringLiteral
src/components/LoginForm.js:10:40
 */
 const LoginForm = ({ startLogin }) => {
   // States for tracking form input which are the email address and password
-  const [ email, setEmail ] = useState('')
+  const [ email, setEmail ] = useState("Stryker was here!")
   const [ password, setPassword ] = useState('')
 

[Killed] BlockStatement
src/components/LoginForm.js:14:34
   const [ password, setPassword ] = useState('')
 
   // onSubmit event handler of this form
-  const handleLogin = (event) => {
-    // Preventing default submission of the form to the action attribute URL
-    event.preventDefault()
-
-    const credentials = {
-      email, password
-    }
-
-    // Calling startLogin with the provided credentials that will make a call to the backend
-    startLogin(credentials)
-
-    // Reset the form state, i.e. the text that's on the username and password text boxes to empty strings
-    setEmail('')
-    setPassword('')
-  }
+  const handleLogin = (event) => {}
 
   // Typically keep id attributes on your HTML elements so that they can be styled using CSS
killedBy: LoginForm Component calls startLogin with correct credentials on form submission
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] StringLiteral
src/components/LoginForm.js:26:14
     startLogin(credentials)
 
     // Reset the form state, i.e. the text that's on the username and password text boxes to empty strings
-    setEmail('')
+    setEmail("Stryker was here!")
     setPassword('')
   }
killedBy: LoginForm Component clears input fields after submission
statusReason: Error: expect(element).toHaveValue()

Expected the element to have value:

Received:
  Stryker was here!

[Killed] ArrowFunction
src/components/LoginForm.js:44:19
         // This event handler as written below, updates the email state with what's being typed by the user
         // Because a state has been updated, the form component will be re-rendered and you can see the updated input
         // on the screen, obviously this happens so fast that you cannot see it but this is the entire procedure
-        onChange={event => setEmail(event.target.value)}
+        onChange={() => undefined}
         id='email'
         required
killedBy: LoginForm Component updates state when input values change
statusReason: Error: expect(element).toHaveValue(test@example.com)

Expected the element to have value:
  test@example.com
Received:

[Killed] ArrowFunction
src/components/LoginForm.js:54:19
         type='password'
         placeholder='Password'
         value={password}
-        onChange={event => setPassword(event.target.value)}
+        onChange={() => undefined}
         id='password'
         required
killedBy: LoginForm Component updates state when input values change
statusReason: Error: expect(element).toHaveValue(password123)

Expected the element to have value:
  password123
Received:
