[Survived] StringLiteral
src/components/Salary.js:7:19
 
 const Salary = ({ user, setUser }) => {
   const [salaryDetails, setSalaryDetails] = useState({
-    employeeName: "Vicky Panchal",
+    employeeName: "",
     paymentDate: "2023-11-26",
     totalSalary: 50000,

[Survived] StringLiteral
src/components/Salary.js:8:18
 const Salary = ({ user, setUser }) => {
   const [salaryDetails, setSalaryDetails] = useState({
     employeeName: "Vicky Panchal",
-    paymentDate: "2023-11-26",
+    paymentDate: "",
     totalSalary: 50000,
     description: "Monthly Salary",

[Survived] StringLiteral
src/components/Salary.js:10:18
     employeeName: "Vicky Panchal",
     paymentDate: "2023-11-26",
     totalSalary: 50000,
-    description: "Monthly Salary",
+    description: "",
     otherDeductions: 5000,
     netSalary: 30000,

[Survived] StringLiteral
src/components/Salary.js:23:55
   useEffect(() => {
     const fetchSalaryDetails = async () => {
       try {
-        const token = JSON.parse(localStorage.getItem('loggedInUser')).access_token; // Replace with your authorization token
+        const token = JSON.parse(localStorage.getItem("")).access_token; // Replace with your authorization token
         const facultyId = JSON.parse(localStorage.getItem('loggedInUser')).user_id; // Replace with the actual faculty ID
         console.log()

[Survived] StringLiteral
src/components/Salary.js:24:59
     const fetchSalaryDetails = async () => {
       try {
         const token = JSON.parse(localStorage.getItem('loggedInUser')).access_token; // Replace with your authorization token
-        const facultyId = JSON.parse(localStorage.getItem('loggedInUser')).user_id; // Replace with the actual faculty ID
+        const facultyId = JSON.parse(localStorage.getItem("")).user_id; // Replace with the actual faculty ID
         console.log()
         const response = await axios.get(`/api/v1/employee/salary/${facultyId}`, {

[Survived] StringLiteral
src/components/Salary.js:26:42
         const token = JSON.parse(localStorage.getItem('loggedInUser')).access_token; // Replace with your authorization token
         const facultyId = JSON.parse(localStorage.getItem('loggedInUser')).user_id; // Replace with the actual faculty ID
         console.log()
-        const response = await axios.get(`/api/v1/employee/salary/${facultyId}`, {
+        const response = await axios.get(``, {
           headers: {
             "access-control-allow-origin" : "*",

[Survived] StringLiteral
src/components/Salary.js:29:28
         const response = await axios.get(`/api/v1/employee/salary/${facultyId}`, {
           headers: {
             "access-control-allow-origin" : "*",
-            Authorization: `Bearer ${token}`,
+            Authorization: ``,
           },
         });

[Survived] ArrowFunction
src/components/Salary.js:34:52
         });
         console.log("response: "+ JSON.stringify(response.data[2]));
         // Update state with the fetched data
-        const history = response.data.slice(1).map(item => ({
-          paymentDate: item.paymentDate,
-          amount: item.amount,
-          salarySlip: item.salarySlip
-        }));
+        const history = response.data.slice(1).map(() => undefined);
 
         setSalaryDetails({

[Survived] MethodExpression
src/components/Salary.js:34:25
         });
         console.log("response: "+ JSON.stringify(response.data[2]));
         // Update state with the fetched data
-        const history = response.data.slice(1).map(item => ({
+        const history = response.data.map(item => ({
           paymentDate: item.paymentDate,
           amount: item.amount,

[Survived] BlockStatement
src/components/Salary.js:49:23
           netSalary: response.data.amount,
           history: history,
         });
-      } catch (error) {
-        // Handle error
-        console.error('Error fetching salary details:', error);
-      }
+      } catch (error) {}
     };
 

[Survived] BlockStatement
src/components/Salary.js:58:55
     fetchSalaryDetails();
   }, []);
 
-  const handleDownload = async (month, salarySlip) => {
-    console.log(`Downloading salary slip for ${salarySlip}`);
-
-    window.open('http://localhost:8081/api/v1/employee/download?path=' + salarySlip, '_blank');
-  };
+  const handleDownload = async (month, salarySlip) => {};
   console.log(salaryDetails);
   return (

[Survived] ArithmeticOperator
src/components/Salary.js:85:43
               <p>₹{salaryDetails.totalSalary}</p>
               <p>18%</p>
               <p>{salaryDetails.description}</p>
-              <p className="net-salary">₹{salaryDetails.totalSalary - 0.18*salaryDetails.totalSalary}</p>
+              <p className="net-salary">₹{salaryDetails.totalSalary + 0.18 * salaryDetails.totalSalary}</p>
             </div>
           </div>

[Survived] ArithmeticOperator
src/components/Salary.js:85:71
               <p>₹{salaryDetails.totalSalary}</p>
               <p>18%</p>
               <p>{salaryDetails.description}</p>
-              <p className="net-salary">₹{salaryDetails.totalSalary - 0.18*salaryDetails.totalSalary}</p>
+              <p className="net-salary">₹{salaryDetails.totalSalary - 0.18 / salaryDetails.totalSalary}</p>
             </div>
           </div>

[Survived] ArrowFunction
src/components/Salary.js:92:40
         <div className="salary-history">
           <h2 className="section-heading">Salary Disbursement History</h2>
           <ul className="history-list">
-            {salaryDetails.history.map((entry, index) => (
-              <li key={index} className="history-item">
-                <span>{new Date(entry.paymentDate).toLocaleDateString()}</span>
-                <span>Amount: ₹{entry.amount}</span>
-                <button onClick={() => handleDownload(new Date(entry.paymentDate).toLocaleDateString(), entry.salarySlip)}>
-                  Download Slip
-                </button>
-              </li>
-            ))}
+            {salaryDetails.history.map(() => undefined)}
           </ul>
         </div>

[Survived] ArrowFunction
src/components/Salary.js:96:34
               <li key={index} className="history-item">
                 <span>{new Date(entry.paymentDate).toLocaleDateString()}</span>
                 <span>Amount: ₹{entry.amount}</span>
-                <button onClick={() => handleDownload(new Date(entry.paymentDate).toLocaleDateString(), entry.salarySlip)}>
+                <button onClick={() => undefined}>
                   Download Slip
                 </button>
