[Killed] BlockStatement
src/services/login.js:6:38
 // The API endpoint where login data is sent to
 const loginBaseUrl = `/api/v1/auth/authenticate`
 
-const login = async (credentials) => {
-  // Send the login credential data to the loginBaseUrl API endpoint as an HTTP POST request
-  // Note the async-await
-  const response = await axios.post(loginBaseUrl, credentials)
-  console.log(response.data);
-  // Return .data field of the response object which would contain the logged in user object
-  // And the user state would now be updated by the handleLogin() method
-  return response.data
-}
+const login = async (credentials) => {}
 
 // Export the method as an object so that it can be accessible outside this file as a service
killedBy: loginService sends a POST request with credentials and returns data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ObjectLiteral
src/services/login.js:17:22
 }
 
 // Export the method as an object so that it can be accessible outside this file as a service
-const exportObject = { login }
+const exportObject = {}
 export default exportObject
killedBy: loginService sends a POST request with credentials and returns data
statusReason: TypeError: _login.default.login is not a function
