[Survived] BlockStatement
src/components/NavBar.js:12:39
   - Logout Button
   - In more complex webpages you can include routes here with the help of React-Router
 */
-const NavBar = ({ user, setUser }) => {
-  // If the Logout button has been clicked then clear the loggedInUser object from localStorage and
-  // update "user" state to null, in order to logout, otherwise on the next reload, the Effect hook will again read the user
-  // from the localStorage and relogin without showing the login form
-  const logout = () => {
-    window.localStorage.removeItem('loggedInUser')
-    setUser(null)
-  }
-
-  // Prevents Key Exception errors if "user" state hasn't loaded yet
-  if (!user)
-    return null
-
-  // Fully styled Navbar using Bootstrap (it can be a big pain to style Navbars)
-  return (
-    <div className="navbar">
-      <Link to="/" className="left-button">Home</Link>
-      <div className="right-buttons">
-        {/* <Link to="/salary">Salary</Link> */}
-        {/* <Link to="/profile">Profile</Link> */}
-        <button onClick={logout}>Logout</button>
-      </div>
-    </div>
-  )
-}
+const NavBar = ({ user, setUser }) => {}
 
 export default NavBar

[Survived] BlockStatement
src/components/NavBar.js:16:24
   // If the Logout button has been clicked then clear the loggedInUser object from localStorage and
   // update "user" state to null, in order to logout, otherwise on the next reload, the Effect hook will again read the user
   // from the localStorage and relogin without showing the login form
-  const logout = () => {
-    window.localStorage.removeItem('loggedInUser')
-    setUser(null)
-  }
+  const logout = () => {}
 
   // Prevents Key Exception errors if "user" state hasn't loaded yet

[Survived] StringLiteral
src/components/NavBar.js:17:36
   // update "user" state to null, in order to logout, otherwise on the next reload, the Effect hook will again read the user
   // from the localStorage and relogin without showing the login form
   const logout = () => {
-    window.localStorage.removeItem('loggedInUser')
+    window.localStorage.removeItem("")
     setUser(null)
   }

[Survived] ConditionalExpression
src/components/NavBar.js:22:7
   }
 
   // Prevents Key Exception errors if "user" state hasn't loaded yet
-  if (!user)
+  if (false)
     return null
 

[Survived] BooleanLiteral
src/components/NavBar.js:22:7
   }
 
   // Prevents Key Exception errors if "user" state hasn't loaded yet
-  if (!user)
+  if (user)
     return null
 
